{
    "title": "Super Version 4.1.0-beta1 (com.macjutsu.super)",
    "description": "Preference settings for S.U.P.E.R.M.A.N. update script. WARNING: Test Mode defaults to true, please remember to set to false before deploying. Full details on these settings can be found in the wiki: https://github.com/Macjutsu/super/wiki",
    "__preferencedomain": "com.macjutsu.super",
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "AuthJamfComputerID": {
            "title": "Auth Jamf Computer ID",
            "description": "Use this when using super with Jamf Pro API account.",
            "type": "string",
            "enum": ["$JSSID"],
            "default": "$JSSID"
        },
        "DeferralTimerDefault": {
            "title": "Default Defer Timer",
            "description": "The number of minutes to defer until the next update attempt if a user chooses not to update restart. It must be between 2 and 1440. Default deferral time is 60. Put X to diasble this option.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "60"
                }
            }
        },
        "DeferralTimerFocus": {
            "title": "Focus Defer Timer",
            "description": "The number of minutes to defer the update restart dialog automatically if a process has prevented display sleep (for example, during an active meeting) or the user has Focus or Do Not Disturb enabled. It must be between 2 and 1440. Put X to diasble this option.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "60"
                }
            }
        },
        "DeferralTimerMenu": {
            "title": "Menu Defer Timer",
            "description": "Display a deferral time pop-up menu in the non-deadline update restart dialog that allows the user to overide the DeferralTimerDefault time. It must be between 2 and 1440. Put X to diable this option.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "30,60,1440"
                }
            }
        },
        "DeferralTimerWorkflowRelaunch": {
            "title": "Workflow Relaunch Defer Timer",
            "description": "The number of minutes to defer if no software updates are found. It must be between 2 and 43804. Put X to diable this option.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "1440"
                }
            }
        },
        "DeferralTimerError": {
            "title": "Error Defer Timer",
            "description": "The number of minutes to defer if super detects an error in the workflow (for example, network or MDM connectivity issues). It must be between 2 and 1440. Default deferral time is 60. Put X to diasble this option.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "60"
                }
            }
        },
        "DeadlineCountFocus": {
            "title": "Focus Count Deadline",
            "description": "The maximum number of automatic deferrals allowed if the system is in user-enabled Focus/Do Not Disturb or when a process has requested that the display not go to sleep (for example, during an active meeting). Put X to diable this option.",
            "type": "string"
        },
        "DeadlineCountSoft": {
            "title": "Soft Count Deadline",
            "description": "The maximum number of user selected deferrals allowed before the soft deadline automatically restarts for updates without asking the user for approval. Put X to diable this option.",
            "type": "string"
        },
        "DeadlineCountHard": {
            "title": "Hard Count Deadline",
            "description": "The maximum number of user selected deferrals allowed before the computer automatically restarts for updates without asking the user for approval. Put X to diable this option.",
            "type": "string"
        },
        "DeadlineDaysFocus": {
            "title": "Focus Days Deadline",
            "description": "The maximum number of days that automatic deferrals are allowed if the system is in user-enabled Focus/Do Not Disturb or when a process has requested that the display not go to sleep (for example, during an active meeting). Put X to diable this option.",
            "type": "string"
        },
        "DeadlineDaysSoft": {
            "title": "Soft Days Deadline",
            "description": "The maximum number of days allowed before the soft deadline dialog. The soft deadline is an interactive update restart dialog indicating that no more deferrals are allowed. Put X to diable this option.",
            "type": "string"
        },
        "DeadlineDaysHard": {
            "title": "Hard Days Deadline",
            "description": "The maximum number of days allowed before the computer automatically restarts for updates without asking the user for approval. Put X to diable this option.",
            "type": "string"
        },
        "WorkflowZeroDateManual": {
            "title": "Manual Zero Day Workflow Date",
            "description": "Instead of having the days deadline counter, automatically select the day zero date. PutX to diable this option.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "YYYY-MM-DD:hh:mm"
                }
            }
        },
        "WorkflowZeroDateRelease": {
            "title": "Apple Zero Day Workflow Date",
            "description": "Leverages the public MacAdmin's SOFA macOS machine readable JSON feed to discover release dates for use in workflows with deadline day options.",
            "type": "boolean",
            "default": "true",
            "links": [
                {
                    "rel": "More information",
                    "href": "https://sofa.macadmins.io/"
                }
            ]
        },
        "WorkflowZeroDateSOFACustomURL": {
            "title": "Apple Zero Day Custom URL",
            "description": "Allows for a custom self-hosted MacAdmin's SOFA macOS machine readable JSON feed.",
            "type": "string",
            "links": [
                {
                    "rel": "More information",
                    "href": "https://github.com/macadmins/sofa?tab=readme-ov-file#self-hosting-sofa"
                }
            ],
            "options": {
                "inputAttributes": {
                    "placeholder": "https://sofa.example.domain.com/v1/macos_data_feed.json"
                }
            }
        },
        "DeadlineDateFocus": {
            "title": "Focus Date Deadline",
            "description": "This is the last date and time when automatic deferrals are allowed if the system is in user-enabled Focus/Do Not Disturb or when a process has requested that the display not go to sleep (for example, during an active meeting). Put X to diable this option.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "YYYY-MM-DD:hh:mm"
                }
            }
        },
        "DeadlineDateSoft": {
            "title": "Soft Date Deadline",
            "description": "If this date and time have passed, an interactive update restart dialog appears indicating that no more user deferrals are allowed. Put X to disable this option.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "YYYY-MM-DD:hh:mm"
                }
            }
        },
        "DeadlineDateHard": {
            "title": "Hard Date Deadline",
            "description": "If this date has passed, the computer restarts and udpates without asking the user for approval. Put X to diable this option.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "YYYY-MM-DD:hh:mm"
                }
            }
        },
        "DialogTimeoutDefault": {
            "title": "Default Dialog Timeout",
            "description": "Sets the default timeout for any dialog that doesn't have a specific timeout setting",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "600"
                }
            }
        },
        "DialogTimeoutRestartOrDefer": {
            "title": "Restart or Defer Display Timeout",
            "description": "Sets an automatic timeout for interactive update restart dialogs in seconds. The countdown of the timeout is displayed in the update restart dialog. Put X to diable this option.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "600"
                }
            }
        },
        "DialogTimeoutSoftDeadline": {
            "title": "Soft Display Timeout",
            "description": "Sets an automatic timeout for interactive update restart dialogs in seconds. The countdown of the timeout is displayed in the update restart dialog. Put X to diable this option.",
            "type": "string"
        },
        "DisplayUnmovable": {
            "title": "Display Unmovable Dialogs and Notifications",
            "description": "Prevents the user from moving dialogs and notifications. Put X to diable this option.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "ALWAYS,SOFT,HARD,INSTALLNOW,DEFER,USERAUTH,POWER,STORAGE"
                }
            }
        },
        "DisplayHideBackground": {
            "title": "Display Hide Background",
            "description": "Hide the background while displaying super dialogs and notifications. Using this option hides all other windows (including full screen mode) and the background via blur effect while displaying super dialogs and notifications. Put X to diable this option.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "ALWAYS,SOFT,HARD,INSTALLNOW,DEFER,USERAUTH,POWER,STORAGE"
                }
            }
        },
        "DisplayHideProgressBar": {
            "title": "Display Hide Progress Bar",
            "description": "This option hides the animated progress bar (as opposed showing it) for notifications and alerts. Put X to diable this option.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "ALWAYS,SOFT,HARD,INSTALLNOW,POWER,STORAGE"
                }
            }
        },
        "DisplayNotificationsCentered": {
            "title": "Display Notifications Centered",
            "description": "Shows non-interactive notifications in the center of the screen as opposed to the top right. Put X to diable this option.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "ALWAYS,SOFT,HARD,INSTALLNOW,"
                }
            }
        },
        "DisplayIconFile": {
            "title": "Display Icon",
            "description": "Local path or http(s) URL to a file that is the picture to display in  notifications or dialogs. Put X to reset this to default.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "https://example.com/sample.png"
                }
            }
        },
        "DisplayIconSize": {
            "title": "Icon Size",
            "description": "Number of pixels for the DisplayIcon in IBM Notifier dialogs. The value must be in between 96 and 150. Put X to reset this to default.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "128"
                }
            }
        },
        "DisplayAccessoryType": {
            "title": "Custom Display Accessory",
            "description": "Interactive dialogs (but not notifications) generated by IBM Notifier can be easily customized via several display accessory options. The display accessory content appears below any deferral or deadline text but above any interactive item like the deferral pop-up menu or user authentication field. Put X to disable this option.",
            "type": "string",
            "enum": ["X", "TEXTBOX", "HTMLBOX", "HTML", "IMAGE", "VIDEO", "VIDEOAUTO"],
            "default": "X"
        },
        "DisplayAccessoryDefaultFile": {
            "title": "Default Accessory",
            "description": "Local path or http(s) URL to a file that is the default accessory. Put X to reset this to default.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "https://example.com/sample.png"
                }
            }
        },
        "DisplayAccessoryUpdateFile": {
            "title": "Updates Accessory",
            "description": "Local path or http(s) URL to a file that is the accessory to display when performing macOS updates. Put X to reset this to default.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "https://example.com/sample.png"
                }
            }
        },
        "DisplayAccessoryUpgradeFile": {
            "title": "Upgrades Accessory",
            "description": "Local path or http(s) URL to a file that is the accessory to display when performing macOS upgrades. Put X to reset this to default.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "https://example.com/sample.png"
                }
            }
        },
        "DisplayAccessoryUserAuthFile": {
            "title": "Apple Silicon User Authentication Accessory",
            "description": "Local path or http(s) URL to a file that is the accessory to display when Apple Silicon Macs require user authentication. Put X to reset this to default.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "https://example.com/sample.png"
                }
            }
        },
        "DisplayHelpButtonString": {
            "title": "Help Button",
            "description": "Plain text to display or http(s) URL link to follow for the Help Button. Put X to disable this option.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "https://example.com/sample.png"
                }
            }
        },
        "DisplayWarningButtonString": {
            "title": "Warning Button",
            "description": "Plain text or http(s) URL link to follow for the Warning Button. Put X to disable this option.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "https://example.com/sample.png"
                }
            }
        },
        "DisplaySilently": {
            "title": "Display Dialogs Silently",
            "description": "When enabled, the system alert sound is suppressed when displaying dialogs.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "ALWAYS,SOFT,HARD,INSTALLNOW,DEFER,USERAUTH,POWER,STORAGE"
                }
            }
        },
        "DialogTimeoutUserAuth": {
            "title": "User Authentication Timeout",
            "description": "On Mac computers with Apple Silicon, the number of seconds to wait for the user to successfully authenticate when presented with the user authenticated dialog. This dialog does not show a visual countdown of the timeout. Default time is 3600seconds (1 hour).",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "600"
                }
            }
        },
        "AuthJamfCustomURL": {
            "title": "Jamf Custom URL Override",
            "description": "Allows you to override the default Jamf Pro management URL for a custom Jamf Pro API URL.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "https://jamf-api.example.domain.com"
                }
            }
        },
        "AuthAskUserToSavePassword": {
            "title": "Authentication Ask User to Save Password",
            "description": "Prompt the end user to save their password which can then be used to authenticate the local softwareupdate command.",
            "type": "boolean",
            "default": "true"
        },
        "AuthMDMFailoverToUser": {
            "title": "User Authentication MDM Failover",
            "description": "The MDM workflow can be unreliable due to its complexity, and super will automatically try again upon failure, however this settings allows super to try other options. For more information see https://github.com/Macjutsu/super/wiki/Apple-Silicon-Jamf-Pro-API-Credentials#user-authentication-mdm-failover. Put X to diable this option.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "ALWAYS,NOSERVICE,SOFT,HARD,INSTALLNOW,BOOTSTRAP"
                }
            }
        },
        "AuthCredentialFailoverToUser": {
            "title": "Credential Authentication Failover To User",
            "description": "If any managed automatic authentication method fails validation, then failover to local end user authentication.",
            "type": "boolean",
            "default": "true"
        },
        "InstallMacOSMajorUpgrades": {
            "title": "Allow Upgrades",
            "description": "macOS now presents some Upgrades options as updates, super detects and ignores them by default (objective update over upgrade). Enabling this setting will allow the upgrades.",
            "type": "boolean"
        },
        "InstallMacOSMajorVersionTarget": {
            "title": "Target Upgrades",
            "description": "This setting provides a limitation on the Allow Upgrades setting, providing some management of the maximum macOS version to upgrade to.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "13"
                }
            }
        },
        "InstallRapidSecurityResponses": {
            "title": "Allow Rapid Security Response Updates",
            "description": "macOS 13.3+ Ventura support Rapid Security Response updates, which super will ignore if this is not enabled. super will ignore this setting on older macOS versions.",
            "type": "boolean"
        },
        "InstallNonSystemUpdatesWithoutRestarting": {
            "title": "Enforce Non-System Updates",
            "description": "If you don't want the super workflow to wait for a macOS update to also install non-system Apple software updates, then you can enforce those non-system updates as soon as they become available.",
            "type": "boolean"
        },
        "WorkflowOnlyDownload": {
            "title": "Only Download Updates",
            "description": "Download and prepare any available macOS updates but do not start any installation workflow. This super option is designed to work along with the --install-now option to significantly reduce the user experience wait time for user-initiated macOS update workflows.",
            "type": "boolean"
        },
        "TestStorageUpdate": {
            "title": "Test Free Space Update",
            "description": "Free Space Required for updates",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "15"
                }
            }
        },
        "TestStorageUpgrade": {
            "title": "Test Free Space Upgrade",
            "description": "Free Space Required for upgrades",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "35"
                }
            }
        },
        "DialogTimeoutInsufficientStorage": {
            "title": "Test Free Space Timeout",
            "description": "Timeout for computers with not enough free space.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "600"
                }
            }
        },
        "TestBatteryLevel": {
            "title": "Test BatteryLevel",
            "description": "Minmum Battery Percentage",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "50"
                }
            }
        },
        "DialogTimeoutPowerRequired": {
            "title": "Battery Timeout",
            "description": "Timeout for computers where power is required.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "600"
                }
            }
        },
        "WorkflowJamfPolicyTriggers": {
            "title": "Policy Triggers",
            "description": "If a restart is required for system updates or forced via RestartWithoutUpdates, this list of Jamf Policy Triggers runs before any available updates install and the computer restarts.",
            "type": "string",
            "options": {
                "inputAttributes": {
                    "placeholder": "triggerA,triggerB,triggerC"
                }
            }
        },
        "WorkflowDisableUpdateCheck": {
            "title": "Skip Updates",
            "description": "Skip Apple software updates, even if they are available.",
            "type": "boolean"
        },
        "WorkflowDisableRelaunch": {
            "title": "Disable Super Auto-Relaunch",
            "description": "Prevents super from checking for new updates/upgrades on a reoccurring basis.",
            "type": "boolean",
            "default": "false"
        },
        "WorkflowRestartWithoutUpdates": {
            "title": "Restart Without Updates",
            "description": "Force a restart even if Apple software updates do not need it.",
            "type": "boolean",
            "default": "false"
        },
        "TestMode": {
            "title": "Test Mode",
            "description": "Mode to validate parameters, credentials, notifications, dialogs, deferrals, and deadline logic.",
            "type": "boolean",
            "default": "true"
        },
        "TestModeTimeout": {
            "title": "Test Mode Timeout",
            "description": "The amount of time in seconds to leave test notifications and dialogs open before moving on in the workflow.",
            "type": "string"
        },
        "VerboseMode": {
            "title": "Verbose Mode",
            "description": "Mode to generate additional log output.",
            "type": "boolean"
        }
    }
}